namespace HistoryPortal.Data.Migrations
{
    using System;
    using System.Data.Entity;
    using System.Data.Entity.Migrations;
    using System.Linq;

    using HistoryPortal.Data.Models;
    using System.Collections.Generic;

    internal sealed class Configuration : DbMigrationsConfiguration<ApplicationDbContext>
    {
        public Configuration()
        {
            this.AutomaticMigrationsEnabled = true;

            // TODO: Remove in production
            this.AutomaticMigrationDataLossAllowed = true;
        }

        protected override void Seed(ApplicationDbContext context)
        {
            this.SeedArticles(context);
        }

        private void SeedArticles(ApplicationDbContext context)
        {
            if (context.Articles.Any())
            {
                return;
            }

            context.Categories.AddOrUpdate(c => c.Id,
                new Category
                {
                    Name = "Great Bulgaria"
                },
                new Category
                {
                    Name = "First Bulgarian Kingdom"
                },
                new Category
                {
                    Name = "Bulgaria Under Byzantium Slavery"
                },
                new Category
                {
                    Name = "Second Bulgarian Kingdom"
                },
                new Category
                {
                    Name = "Bulgaria Under Ottoman Slavery"
                },
                new Category
                {
                    Name = "Third Bulgarian Kingdom"
                });

            context.SaveChanges();

            context.Articles.AddOrUpdate(a => a.Id,
                new Article
                {
                    Title = "ДЕЛЕЖА НА ВЕЛИКА БЪЛГАРИЯ",
                    Content = "Българската държава в Кара Булгарския период(7 - 9 век)НАЧАЛО НА ДЕЛЕЖА НА ВЕЛИКА БЪЛГАРИЯПрез този период българската държава имала феодален характер.На върха на съсловната стълба стоял владетеля - КАН-ЦАР ; Балтавар - водач, владетел ; Емир. По - долу едрите светски феодали - бекове(държавни князе) и баи-баили(племенни князе).Под тях царските държавни феодали - алпари или елбири и отделни едри феодали джури-военни.Важна роля в държавата играели духовните лица - жреците а с приемането на исляма и християнството - сеидите и епископите, както и религиозния клир от всички рангове. Всички те влизали в господстващата класа на феодалите.В Булгария към класата на феодалите се включвали и самостоятелните търговци и занаятчии.До 10 век под феодалите стояла класата на селяните(игенчеи), плащащи данъци на Царя и на отделните феодали. Също така служителите на търговците и занаятчиите. Съществувала е експлоатация на роби, но нейния принос за икономиката бил незначителен. От 10 век,когато бил приет исляма за държавна религия, булгарските игенчеи-мюсюлмани почнали да се ползват с правата на феодалната класа а робите да се освобождават ако приемат исляма или след 6 годишна работа на стопанина си.Източник: http://www.bg-history.info/Politichesko-mogushtestvo-na-Bulgariia-pri-Car-Ivan-II-Asen-%281218-1241-g%29-5558.html",
                    CategoryId = 1,
                    State = ArticleState.Approved
                },
                new Article
                {
                    Title = "Политическо могъщество на България при Цар Иван II Асен (1218-1241 г.)",
                    Content = "Второто българско царство достигнало апогея на своята политическа и военна мощ по времето на цар Иван II Асен. Макар и за недълъг период, под властта на Търново били обединени всички етнически български земи на Балканите. България отново се превърнала в политически фактор от първа величина в Европа с водеща роля в Югоизточния район на континента. Процесът на стабилизация и подем се отразил на стопанския живот, както и на културата. Голямо значение за страната имало и възтановяването на православната българска патриаршия през 1235 г.Жизнения път на знаменития владетел не бил гладък и лесен. Още като дете и той като братовчедите си останал сирак и подобно на някои от тях скоро го постигнала участта на изгнаник, далеч от родината.За негова чест Иван Асен не се превърнал в безпринципен авантюрист и марионетка в ръцете на чужди сили, както някои други злополучни принцове и царски роднини през средновековието. Той се наредил до тези, които намирали вярната пресечна точка между личните амбиции и интересите на българската държава.Внезапната смърт на цар Калоян предизвикала междуособици, в които се наложил неговият племеник Борил.Той отстранил от Търново претендентите Слав и Стрез, също царски племеници.Източник: http://www.bg-history.info/Politichesko-mogushtestvo-na-Bulgariia-pri-Car-Ivan-II-Asen-%281218-1241-g%29-5558.html",
                    CategoryId = 4,
                    State = ArticleState.Approved
                },
                new Article
                {
                    Title = "Въстанието на принцовете Петър и Асен за извоюване независимостта на Царство България",
                    Content = "Те наистина са принцове, както ги наричат летописците от Волжка България, живеещи в \"стария дом\" на предците си в Търново. А въстанието и войната за независимост си е лично тяхно дело и \"приумица\"...!За произхода на династията АСЕН по сведенията от \"Джагфар тарихи\":\"...Стареца Умар обаче скоро починал и на трона бил издигнат АЗАН ТУКТА. Син на Кермек и дъщерята на аварския каган Улаг от рода Магунти. Рода Дуло си върнал властта.В детството си Азан бил доста слаб и кам-бояните му дали заговорено име... По-голямата част от живота си прекарал в служба при аварите далеч от политическите ежби в България.Азан бил баща на КРУМ и брат на КАРДАМ. Всички дунавско-български царе след него носили родовото име АЗАН(АСЕН).Жената на Азан била княгиня от рода Урус-Алан.Тяхната дъщеря Арья Услан била омъжена за Кан-Караджара и родила най-великия цар на Кара Булгара - Урус Айдара!Майката на средния син на Омуртаг - Джан Арбат(Енравота) биламаджарска княгиня...\"Необходими са още уточнения по въпроса за произхода на Асеневци, тъй като фантазиите и спекулациите и тук не са спрели нито за миг...Кой е този техен \"родоначалник\" Азан Тукта? Него все още го наричат \"Хан Токту\"(766-767)...В чуждите им извори пишело, че бил \"мъж българин, брат на Баян\". Това е сведение на виз. хронист Никифор. Сигурно е това, че брат му Баян е бил известна за времето си личност сред византийците, щом чрез него се обяснява кой е всъщност владетеля Токту. Защо така?Източник: http://www.bg-history.info/-Vustanieto-na-princovete-Petur-i-Asen-za-izvoiuvane-nezavisimostta-na-Carstvo-Bulgariia-5556.html",
                    CategoryId = 3,
                    State = ArticleState.Approved
                },
                new Article
                {
                    Title = "Бурджаните са огромен, могъщ и войнствен народ, който е подчинил всички съседни народи.",
                    Content = "<p><strong>Бурджаните са огромен, могъщ и войнствен народ,</p><p>който е подчинил всички съседни народи.</p><p>Един български конник може да излезе на глава на 100</p><p>или 200 конници от неверниците.&rdquo;</p><p>Абу ал-Хасан ал-Масуди,</p><p><em>&bdquo;Златни ливади и източниците на бисери&rdquo;</em></strong></p><p>&hellip;</p><p>В ранните зори на 14 август 717 г. лагерът на емир Маслама край Силимбрия беше още потънал в дълбок сън и никой, дори и охраната, не забеляза лумналия в гората далече на север буен огън.</p><p>Изведнъж от запад се надигна страхотен грохот и черна лавина от хора и коне, облечени целите в желязо, се стовари върху сарацините. Настана паника, никой не знаеше какво става, хиляди хора се лутаха като замаяни от ужас, уплашени коне, отвързани или изтървани, тичаха като подивели из лагера, а първите десетки жертви вече лежаха мъртви. И преди някой от арабите да успее да разбере каквото и да било, от изток се надигна с оглушителен тътен нова стена от страховити конници и насмете пред себе си първите попаднали на пътя им сънени и лутащи се безпомощно войници.</p><p>Клането по двата края на големия боен лагер беше безмилостно жестоко, а в центъра пълководецът Убайда хладнокръвно организираше отбраната по двата фланга, без дори да знае кой го е нападнал. Арабите постепенно се съвземаха от шока и се отбраняваха ожесточено, но пешаците, изправени пред желязната стена на българската конница, падаха покосени редица след редица.</p>",
                    CategoryId = 2,
                    State = ArticleState.Approved
                },
                new Article
                {
                    Title = "Цар Калоян (Иван I)",
                    Content = "<p><strong>Победителят на рицарите</strong></p><p>Малко сведения от предисторията на това царуване:</p><p>(...)</p><p>http://atil.blog.bg/history/2011/07/27/dinastichni-i-rodninski-vryzki-mejdu-carskite-rodove-na-duna.791297</p><p><strong>Известия от</p><p>Кул Гали &quot;Хон Китаби&quot;.1242 г. </strong>:</p><p></p><p><em>&quot;...Когато Белебей казал на царя Габдулла, че на запад има още една Булгария, която се нарича също и Улаг и Кара Бурджан(Дунавска България), то Челбир не повярвал на това и изпратил в Бащу(Киев) посолство за проверка на това съобщение. Недоверчивостта на Кана се обяснявала с това,че по сведения на гърците, те отдавна били завоювали Кара Бурджан и изтребили тамошните булгари.</em></p>",
                    CategoryId = 4,
                    State = ArticleState.Approved
                },
                new Article
                {
                    Title = "Фалшификациите в българската история и техния смисъл",
                    Content = "<p>&nbsp;</p><p><strong>ФАЛШИФИКАЦИИ И МАНИПУЛАЦИИ НА БЪЛГАРСКАТА ИСТОРИЯ</strong></p><p>Проф. Крум Балтаджиев</p><p><em>&quot;Отрежете на едно дърво корените и то ще изсъхне.&quot;</em></p><p>ВЪВЕДЕНИЕ</p><p>(Със звездичка са отбелязани историци и изследователи със специфични небългарски имена или такива с чуждо етническо самосъзнание, прокарващи зловонните идеи на тайни организации и сили, работещи срещу България!)</p>",
                    CategoryId = 4,
                    State = ArticleState.Approved
                },
                new Article
                {
                    Title = "Делото на св.св.Кирил и Методий",
                    Content = "<p>&copy; Стефан Чурешки</p><p></p><p>Поради неясни за мен съображения на Църквата&nbsp; църковния ден за почит на св.св.Кирил и Методий &ndash;11 май - е отделен от всебългарските чествания на деня на старобългарската писменост 24 май, която е празника на двамата братя по стар стил. Това разделение на двата празника откъсва религиозната почит към делото на солунските братя от всенародното честване на славянобългарската азбука и така в съзнанието на модерния българин не се дава възможност за се направи връзка между църковната битийност на българските&nbsp; просветители и тяхното дело за създаване на старобългарската азбука. Това е сериозен проблем на модерното българско и християнско съзнание, защото историческата истина гласи, че нашият свещен език като философска изразност и способност за разпознаване на явленията от света е замислен изключително като религиозен език. В паметта на Църквата и на вярващите светите братя са почитани като равноапостолни, т.е. като равни на апостолите, избрани от Христос да разпространяват вярата и да проповядват сред народите. Тази висока оценка на св.св.Кирил и Методий е подкрепена както от запазения за тях спомен в автентичната народна памет, така и от признанието , която такава старинна и културна институция като папския институт им даде. Защото днес солунските братя са почитани като покровители на Европа и влизайки в Европа като старинна култура ние чрез делото на Кирил и Методий правим едно връщане към самите себе си. В света на идеите и на национално присъствие в един все повече профанизиращ се и технологизиращ се свят най-важното нещо за запазване на народността е запазването на религиозно-културната автентичност на националната самоличност. За да запазим нашата автентична национална самоличност ние се нуждаем повече от всякога от осмисляне на делото на солунските братя и от актуализиране на тяхната идея чрез превода на божествените книги на български език. Защото идеята на солунските братя е чрез славянския език да се конструрират християнските граници на Европа. Създаването на славянобългарската азбука позволява на славяните да възприемат казаното в Света Библия, да разбират текста на божествената света литургия и да развиват своя литература, която да говори за Бога и да тълкува Неговите послания към човечеството. Затова мисията на двамата братя е световна и тя не подлежи на разрушение от времето, нито подлежи на оспорване от страна на&nbsp; отрицателите на християнството като едни от авторите на перспективата&nbsp; на световната цивилизация.</p>",
                    CategoryId = 2,
                    State = ArticleState.Approved
                });

        }
    }
}
